[
  {
    "type": "H1",
    "children": [
      {
        "text": "The Passive Voice of Responsibility"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "I want to start by stating that this essay is not for everyone.  I think there might very well be people out there whose circumstance really do force their hand, and there are things they just have to do.  And there are jobs where the consequence of on individual in action can have life and death effects.  But chances are this is not you.  And that means you "
      },
      {
        "text": "don't have to do anything",
        "Italic": true
      },
      {
        "text": "."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "I often hear I had to work late all week or, even worse I had to have the team, work late all week.  This is the passive voice of responsibility.  These are choices, they might be the consequences of other bad choices already made. You might be faced with only bad choices, but they are choices all the same."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": " When we treat them as our hands being forced a few things happen."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "1. We give up agency. We say it has been taken, but in fact, we are choosing to be powerless."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "2. We remove the benefactor of the effort.  In general, people like to do things for other people when we play the have to game, we are choosing to make people do extraordinary work, for the benefit of the way things are."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "3. We remove cost-benefit analysis.  If we say it has to be done, we are stating that "
      }
    ]
  }
]