[
  {
    "type": "H2",
    "children": [
      {
        "text": "Removes Purpose"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "\"Have to\" is the first clause in a logical statement. And it is the less important of the two statements.  Let's start with a simple example that any parent will know \""
      },
      {
        "text": "You have to brush your teeth",
        "Italic": true
      },
      {
        "text": "\".  "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "In a best-case scenario, people will add their own purpose \""
      },
      {
        "text": "your breath stinks",
        "Italic": true
      },
      {
        "text": "\" or \""
      },
      {
        "text": "so that in the long run your teeth do not fall out",
        "Italic": true
      },
      {
        "text": "\".  This purpose will vary dramatically, and affect the actions people will take to meet the \"have to\"."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "It is also likely that people will just assume there is no purpose, and there is no value to their actions this is even worse than them having the wrong purpose."
      }
    ]
  },
  {
    "type": "H2",
    "children": [
      {
        "text": "Remove Analysis"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "\"Have to\" also stops cost-benefit analysis.  It is a single that cost doesn't matter, and there is nothing you can add that would change that."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": " I have encountered this scenario over and over in my career. A project lead says \""
      },
      {
        "text": "We have to have this work done by Monday morning!",
        "Italic": true
      },
      {
        "text": "\" The developer works all weekend to get the work done and comes in groggy and moody on Monday.  When the leader finds out that the developer pulled a double all-nighter they say \""
      },
      {
        "text": "it was not that important to work all weekend!\"",
        "Italic": true
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Have to short circuits the discussion of what we are willing to give up to achieve the outcome.  "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Mike Crittenden has a saying \"Say things that can be wrong\", where he argues that it is better to make strong statements that can be false than weak statements that are always true.  \"Have to\" is a strong statement that by definition can't be wrong."
      }
    ]
  },
  {
    "type": "H2",
    "children": [
      {
        "text": "Remove Agency"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Finally \"Have to\" removes the actor, it is the passive voice of responsibility. It puts us in a world where things are happening to us by unnamed forces."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "This removes individual agency as well as removing the individual that is making choice, which removes a path for a redress of grevenices."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  }
]