[
  {
    "type": "H1",
    "children": [
      {
        "text": "Use Your Manager"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Often we think of reports as doing things for managers, but as "
      },
      {
        "data": {
          "openModal": true,
          "slatenode": {
            "href": "https://en.wikipedia.org/wiki/Servant_leadership"
          }
        },
        "type": "Link",
        "children": [
          {
            "text": "Servant leadership "
          }
        ]
      },
      {
        "text": "becomes more and more accepted, a new burden falls on you as a report.  Servant leaders need to know how they can serve."
      }
    ]
  },
  {
    "type": "H2",
    "children": [
      {
        "text": "Change Your Mindset"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "To start, one has to change their mindset that you are the driver of what the manager is going to do.  You are responsible for making your manager valuable.  To get the full value out of them you need to ask more of them and experiment with how they can make you better."
      }
    ]
  },
  {
    "type": "H2",
    "children": [
      {
        "text": "Patterns to Get Started"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Here are a few examples of patterns that can be used to have your manager make you better."
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": "Accountability Partner"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Managers are great Accountability partners.  The basic pattern here is to tell your manager something you plan on doing and ask them to check back with you to see if you did it and how it went. "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "This can be very powerful for creating accountability around things that do not have immediate feedback loops."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "One example from my on like is timesheets.  I have repeatedly failed at getting all of my timesheets in on time, I tried reminders I try different time tracking software.  Finely I just asked my manager to please ask me if I got my timesheets in at each one on one. Having to tell my manager I did not do that little task has made so I always have that task done."
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": "Feedback Investigator "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "While getting direct feedback from your peers is by far the most valuable way of getting feedback, sometimes your peers are not interested in giving direct honest feedback. Also, sometimes there is feedback floating around the company not even attached to individuals.  Managers can be tasked with gathering feedback for you!"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "This can be even more powerful if done proactively (this also works with peers by the way).  Tell your manager what you are going to do and ask that they collect feedback on it.  "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "It would be a better world if people would tell you directly but until we get there, people might tell your manager things they would not tell you."
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": "Sounding Board"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "You are about to try something big, maybe risky and you want another opinion on the subject, well you have a person ready to hear you out!"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Now you need to be careful that it does not come across as asking for permission (that would not be as valuable), Also start with a I am going to do X, I want you to help me refine the idea."
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "H3",
    "children": [
      {
        "text": "Help Me Understand"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Your manager is your gateway to the leadership of the company, and sometimes leadership does things that do not make sense.  It is your manager's job to help you understand choices are made and how that is going to affect you. "
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": ""
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "So ask them to explain things.  Note that they might not know right away, so ask them to go find out for you."
      }
    ]
  }
]